; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	)
(:init
	(at plane1 city6)
	(= (capacity plane1) 2814)
	(= (fuel plane1) 903)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city8)
	(= (capacity plane2) 10576)
	(= (fuel plane2) 2819)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 19)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at person1 city4)
	(at person2 city1)
	(at person3 city3)
	(at person4 city1)
	(at person5 city1)
	(at person6 city0)
	(at person7 city7)
	(at person8 city8)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 642)
	(= (distance city0 city2) 502)
	(= (distance city0 city3) 713)
	(= (distance city0 city4) 614)
	(= (distance city0 city5) 882)
	(= (distance city0 city6) 810)
	(= (distance city0 city7) 562)
	(= (distance city0 city8) 955)
	(= (distance city1 city0) 642)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 646)
	(= (distance city1 city3) 570)
	(= (distance city1 city4) 856)
	(= (distance city1 city5) 916)
	(= (distance city1 city6) 965)
	(= (distance city1 city7) 645)
	(= (distance city1 city8) 923)
	(= (distance city2 city0) 502)
	(= (distance city2 city1) 646)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 811)
	(= (distance city2 city4) 960)
	(= (distance city2 city5) 665)
	(= (distance city2 city6) 726)
	(= (distance city2 city7) 652)
	(= (distance city2 city8) 744)
	(= (distance city3 city0) 713)
	(= (distance city3 city1) 570)
	(= (distance city3 city2) 811)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 550)
	(= (distance city3 city5) 602)
	(= (distance city3 city6) 706)
	(= (distance city3 city7) 621)
	(= (distance city3 city8) 595)
	(= (distance city4 city0) 614)
	(= (distance city4 city1) 856)
	(= (distance city4 city2) 960)
	(= (distance city4 city3) 550)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 800)
	(= (distance city4 city6) 615)
	(= (distance city4 city7) 560)
	(= (distance city4 city8) 660)
	(= (distance city5 city0) 882)
	(= (distance city5 city1) 916)
	(= (distance city5 city2) 665)
	(= (distance city5 city3) 602)
	(= (distance city5 city4) 800)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 861)
	(= (distance city5 city7) 703)
	(= (distance city5 city8) 662)
	(= (distance city6 city0) 810)
	(= (distance city6 city1) 965)
	(= (distance city6 city2) 726)
	(= (distance city6 city3) 706)
	(= (distance city6 city4) 615)
	(= (distance city6 city5) 861)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 575)
	(= (distance city6 city8) 818)
	(= (distance city7 city0) 562)
	(= (distance city7 city1) 645)
	(= (distance city7 city2) 652)
	(= (distance city7 city3) 621)
	(= (distance city7 city4) 560)
	(= (distance city7 city5) 703)
	(= (distance city7 city6) 575)
	(= (distance city7 city7) 0)
	(= (distance city7 city8) 544)
	(= (distance city8 city0) 955)
	(= (distance city8 city1) 923)
	(= (distance city8 city2) 744)
	(= (distance city8 city3) 595)
	(= (distance city8 city4) 660)
	(= (distance city8 city5) 662)
	(= (distance city8 city6) 818)
	(= (distance city8 city7) 544)
	(= (distance city8 city8) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city6)
	(at person2 city1)
	(at person3 city7)
	(at person4 city4)
	(at person6 city2)
	(at person7 city6)
	(at person8 city5)
	))

(:metric minimize (+ (* 4 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane2 city8)
   changed: (fuel plane2) from 2819 to 10576
   goals met: 1 of 7
2. (board person8 plane2 city8)
   deleted: (at person8 city8)
   added: (in person8 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 7
3. (fly plane2 city8 city4)
   deleted: (at plane2 city8)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 0 to 3300, (fuel plane2) from 10576 to 7276
   goals met: 1 of 7
4. (board person1 plane2 city4)
   deleted: (at person1 city4)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 1 of 7
5. (fly plane1 city6 city2)
   deleted: (at plane1 city6)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 3300 to 4026, (fuel plane1) from 903 to 177
   goals met: 1 of 7
6. (fly plane2 city4 city3)
   deleted: (at plane2 city4)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 4026 to 6776, (fuel plane2) from 7276 to 4526
   goals met: 1 of 7
7. (board person3 plane2 city3)
   deleted: (at person3 city3)
   added: (in person3 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 1 of 7
8. (fly plane2 city3 city7)
   deleted: (at plane2 city3)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 6776 to 9881, (fuel plane2) from 4526 to 1421
   goals met: 1 of 7
9. (debark person3 plane2 city7)
   deleted: (in person3 plane2)
   added: (at person3 city7)
   changed: (onboard plane2) from 3 to 2
   goals met: 2 of 7
10. (board person7 plane2 city7)
   deleted: (at person7 city7)
   added: (in person7 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 7
11. (refuel plane2 city7)
   changed: (fuel plane2) from 1421 to 10576
   goals met: 2 of 7
12. (fly plane2 city7 city6)
   deleted: (at plane2 city7)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 9881 to 12756, (fuel plane2) from 10576 to 7701
   goals met: 2 of 7
13. (debark person1 plane2 city6)
   deleted: (in person1 plane2)
   added: (at person1 city6)
   changed: (onboard plane2) from 3 to 2
   goals met: 3 of 7
14. (debark person7 plane2 city6)
   deleted: (in person7 plane2)
   added: (at person7 city6)
   changed: (onboard plane2) from 2 to 1
   goals met: 4 of 7
15. (fly plane2 city6 city4)
   deleted: (at plane2 city6)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 12756 to 15831, (fuel plane2) from 7701 to 4626
   goals met: 4 of 7
16. (refuel plane2 city4)
   changed: (fuel plane2) from 4626 to 10576
   goals met: 4 of 7
17. (fly plane2 city4 city5)
   deleted: (at plane2 city4)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 15831 to 19831, (fuel plane2) from 10576 to 6576
   goals met: 4 of 7
18. (debark person8 plane2 city5)
   deleted: (in person8 plane2)
   added: (at person8 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 5 of 7
19. (fly plane2 city5 city1)
   deleted: (at plane2 city5)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 19831 to 24411, (fuel plane2) from 6576 to 1996
   goals met: 5 of 7
20. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 5 of 7
21. (refuel plane2 city1)
   changed: (fuel plane2) from 1996 to 10576
   goals met: 5 of 7
22. (fly plane2 city1 city4)
   deleted: (at plane2 city1)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 24411 to 28691, (fuel plane2) from 10576 to 6296
   goals met: 5 of 7
23. (debark person4 plane2 city4)
   deleted: (in person4 plane2)
   added: (at person4 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 6 of 7
24. (fly plane2 city4 city0)
   deleted: (at plane2 city4)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 28691 to 31761, (fuel plane2) from 6296 to 3226
   goals met: 6 of 7
25. (board person6 plane2 city0)
   deleted: (at person6 city0)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 6 of 7
26. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 31761 to 34271, (fuel plane2) from 3226 to 716
   goals met: 6 of 7
27. (debark person6 plane2 city2)
   deleted: (in person6 plane2)
   added: (at person6 city2)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 7
